* List schools

#+BEGIN_SRC http :pretty
  GET http://localhost:8000/api/v1/schools
#+END_SRC

#+RESULTS:
#+begin_example
{
  "count": 358,
  "next": "http://localhost:8000/api/v1/schools?limit=20&offset=20",
  "previous": null,
  "results": [
    {
      "id": 1,
      "name": "NATIONAL JUNIOR COLLEGE",
      "website": "www.nationaljc.moe.edu.sg",
      "address": "37 HILLCREST ROAD",
      "postal_code": 288913,
      "phone_number": "64661144",
      "fax_number": "64684535",
      "email": "NJC@MOE.EDU.SG",
      "vision_statement": "NJCians demonstrate Loyalty with Integrity; Scholarship with Creativity; Leadership with Sensitivity",
      "mission_statement": "College of the Nation: Home of Scholars and Leaders who Serve with Honour",
      "philosophy": "We seek to create a joyful and lively learning community for students and staff. Every NJCian will leave with a distinctive and memorable experience. They will learn to serve with honour, to be loyal to family and Singapore, to be leaders sensitive to the needs of others, and to be creative in their approach to solving problems. They would have imbibed the values of civility, altruism, resilience and enterprise.",
      "dgp_code": "BUKIT TIMAH",
      "zone_code": "SOUTH",
      "cluster_code": "SOUTH 3",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "MIXED LEVEL",
      "language": "Chinese",
      "offer": "For the Integrated Programme (Junior High), we offer Language Arts (English & Literature), Chemistry, Physics, Biology, Governance & Society, Mathematics (both E and A Maths), History, Geography, Higher Mother Tongue and Mother Tongue for the first 4 years, as well as Integrated Sciences, Thinking, and General Arts Programme (Art and Music) for the first 2 years. Advanced Language Arts, Advanced Humanities and Man & Ideas are also offered to capable students at JH3 & JH4. The College offers a wide range of special programmes in various domains. They are: SPIRE (Special Programme in Inquiry and Research), Research@NJC, Accelerated Mathematics, Advanced Sciences, Art Elective Programme (AEP), NJC Music Programme, Enhanced Boarding Programme, Cultural Mapping-On-The-Move, Leadership,  Values In Action and Guidance Programmes, Humanities Scholarship Programme, Sapphire Scholars Programme and International Programmes.  Students may also offer a Third Language outside of College. Junior High 1 students undergo a special CCA programme known as CAFE.<br />CCAs offered for Junior High are basketball, canoeing, shooting, softball, squash, track and field, Chinese orchestra, Chinese dance, choir, guitar ensemble, Indian dance, Malay dance, string orchestra, symphonic band and Western dance. Students may also join any CCA under the Talent Management Scheme. <br />Note that H1, H2 and H3 subjects listed are only offered at Senior High (JC years)."
    },
    {
      "id": 2,
      "name": "TEMASEK JUNIOR COLLEGE",
      "website": "http://temasekjc.moe.edu.sg",
      "address": "22 BEDOK SOUTH ROAD",
      "postal_code": 469278,
      "phone_number": "64428066",
      "fax_number": "64428762",
      "email": "TEMASEK_JC@MOE.EDU.SG",
      "vision_statement": "An Institute of Distinction, A Dynamic Learning Culture,  A Caring TJC Family",
      "mission_statement": "Broaden Minds, Touch Hearts, Enrich Lives",
      "philosophy": "Set in sprawling grounds recalling a gracious time past, at TJC our feet are firmly planted on the ground but our arms stretch to the sky. Every TJCian is nurtured to be a trailblazer with a heart for we believe that with sound values, we can steer steadfastly and stay true to our course. Mindful of tradition, roused by imagination and fuelled by ambition, TJCians strive to be active learners, caring and committed citizens and ethical leaders. The college achieved the School Distinction Award in 2015, with five awards for best practices for Teaching and Learning, Student All-Round Development, Staff Well-being and Development, Character and Citizenship Education and Partnership.  Our teachers are passionate about the work they do and are part of a dynamic learning culture which is strong in collaboration and continuous innovation and review.  Our teachers actively develop themselves as curriculum leaders in professional knowledge and practice to enhance student learning. Our motto we proudly serve is, \"For College, For Nation\".",
      "dgp_code": "BEDOK",
      "zone_code": "EAST",
      "cluster_code": "EAST 2",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "MIXED LEVEL",
      "language": "Chinese",
      "offer": "TJC 6-Year Integrated Programme provides a seamless progression of learning, empowering students beyond the basics by exposing them to both breadth and depth, leading up to the GCE A-Level Examination in Year 6. The design of the 6-year IP curriculum supports integrative and interdisciplinary learning, extending 'Beyond Basics' through the core curriculum, 'Beyond Boundaries' through extended learning and 'Beyond Self' through student development. It aims at 'Temasek Excellence', engendering in students greatness in intellect, character and leadership. At TJC IP, students have a plethora of programmes to whet their appetites on. There are signature IP programmes crafted by our school such as those for special talent areas (academic, aesthetics, sports), World without Borders, Wonder.Observe.Weave! attachment to external organisations, ACE CCE Programme and Temasek Leadership Showdown.  In addition, there are MOE Elective Programmes - Music Elective Programme (Year 1 to 6), Chinese Language Elective Programme (Year 3 to 6) and Humanities Programme (Year 5 and 6). All TJC IP students will be holistically developed, going forth to green the world."
    },
    {
      "id": 3,
      "name": "JURONG JUNIOR COLLEGE",
      "website": "http://www.jurongjc.moe.edu.sg",
      "address": "800 CORPORATION ROAD",
      "postal_code": 649809,
      "phone_number": "65624611",
      "fax_number": "65624505",
      "email": "jjc@moe.edu.sg",
      "vision_statement": "College of Choice, Education of Value",
      "mission_statement": "Nurturing confident leaders with a global outlook, developing leaders of character with a heart to serve",
      "philosophy": "na",
      "dgp_code": "JURONG WEST",
      "zone_code": "WEST",
      "cluster_code": "WEST 6",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "Chinese",
      "offer": "1. Experiential Learning Programmes (ELP) 2. Entrepreneurship 3. Interest Development Programme"
    },
    {
      "id": 4,
      "name": "ANDERSON JUNIOR COLLEGE",
      "website": "ajc.moe.edu.sg.",
      "address": "4500 ANG MO KIO AVENUE 6",
      "postal_code": 569843,
      "phone_number": "64596822",
      "fax_number": "64598734",
      "email": "anderson_jc@moe.edu.sg",
      "vision_statement": "Passionate Learners, Adventurous Thinkers, Caring Leaders",
      "mission_statement": "To mould men and women of purpose and character",
      "philosophy": "na",
      "dgp_code": "ANG MO KIO",
      "zone_code": "NORTH",
      "cluster_code": "NORTH 5",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "na",
      "offer": "Science research, service-learning, student leadership training, GP improvement & enrichment programmes"
    },
    {
      "id": 5,
      "name": "VICTORIA JUNIOR COLLEGE",
      "website": "http://www.victoriajc.moe.edu.sg/",
      "address": "20 MARINE VISTA",
      "postal_code": 449035,
      "phone_number": "64485011",
      "fax_number": "64438337",
      "email": "victoria_jc@moe.edu.sg",
      "vision_statement": "LiVE like a Victorian<br />- Legendary Spirit<br />- Visionary Leadership<br />- Extraordinary Service",
      "mission_statement": "To ignite the imagination of all Victorians to create the future with conviction, courage and compassion",
      "philosophy": "na",
      "dgp_code": "BEDOK",
      "zone_code": "EAST",
      "cluster_code": "EAST 7",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "Chinese",
      "offer": "Arts Programme  Beyond Borders Programme Higher Education Guidance Programme Olympiad Training Programme Overseas Exchange Programme Scholarship and Mentoring Programme Victoria Science Research Talent Development Programme  Student Leadership Programme   Career Guidance and Work Attachment"
    },
    {
      "id": 6,
      "name": "YISHUN JUNIOR COLLEGE",
      "website": "http://www.yishunjc.moe.edu.sg/",
      "address": "3 YISHUN RING ROAD",
      "postal_code": 768675,
      "phone_number": "62579873",
      "fax_number": "62574373",
      "email": "YISHUN_JC@MOE.EDU.SG",
      "vision_statement": "The Choice College of Leaders with Passion and Integrity",
      "mission_statement": "To nurture righteous leaders, responsible global citizens, who pursue excellence in all endeavours",
      "philosophy": "na",
      "dgp_code": "YISHUN",
      "zone_code": "NORTH",
      "cluster_code": "NORTH 8",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "na",
      "offer": "1. Digital art (includes 3D animation, digital painting, jewellery design, architectural design, fashion design & Ulead Studio).2. Music Programme including the following 3 components:a) Listening/Analysis/History; b)Composition Folio - electroacoustic musics and c) Performance."
    },
    {
      "id": 7,
      "name": "TAMPINES JUNIOR COLLEGE",
      "website": "http://www.tpjc.moe.edu.sg/",
      "address": "2 TAMPINES AVENUE 9",
      "postal_code": 529564,
      "phone_number": "67841955",
      "fax_number": "67810061",
      "email": "tpjc@moe.edu.sg",
      "vision_statement": "A Leader in Every Student.",
      "mission_statement": "To inculcate excellence of achievement, a passion for learning and a zest for life.",
      "philosophy": "na",
      "dgp_code": "TAMPINES",
      "zone_code": "EAST",
      "cluster_code": "EAST 6",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "na",
      "offer": "Overseas VIA Project, School Twinning Programme (Shandong Experimental High School), School Twinning Programme (Pusat Tingkatan Enam Tutong, Brunei)"
    },
    {
      "id": 8,
      "name": "SERANGOON JUNIOR COLLEGE",
      "website": "http://www.srjc.moe.edu.sg",
      "address": "1033 UPPER SERANGOON ROAD",
      "postal_code": 534768,
      "phone_number": "62850779",
      "fax_number": "62825318",
      "email": "srjc@moe.edu.sg",
      "vision_statement": "Leaders and Learners driven by Values and Imagination",
      "mission_statement": "Inspiring all students to have<br />the passion to learn, the heart to serve and the courage to lead",
      "philosophy": "na",
      "dgp_code": "HOUGANG",
      "zone_code": "NORTH",
      "cluster_code": "NORTH 4",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "na",
      "offer": "Camp ASPIRE:Advanced Student Leadership Programme;SR Global Classroom Experience:Educational Fieldtrips and Community Projects;Get REAL!:Reach out to the Environment,Aged and Less Fortunate"
    },
    {
      "id": 9,
      "name": "PIONEER JUNIOR COLLEGE",
      "website": "http://www.pioneerjc.moe.edu.sg",
      "address": "21 TECK WHYE WALK",
      "postal_code": 688258,
      "phone_number": "65646878",
      "fax_number": "67651861",
      "email": "PJC@MOE.EDU.SG",
      "vision_statement": "ALWAYS SERVING, ALWAYS LEARNING",
      "mission_statement": "Nurturing a community of committed learners and compassionate leaders",
      "philosophy": "na",
      "dgp_code": "CHOA CHU KANG",
      "zone_code": "WEST",
      "cluster_code": "WEST 2",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "Chinese",
      "offer": "Sports and outdoor electives"
    },
    {
      "id": 10,
      "name": "MERIDIAN JUNIOR COLLEGE",
      "website": "http://meridianjc.moe.edu.sg/",
      "address": "21 PASIR RIS STREET 71",
      "postal_code": 518799,
      "phone_number": "63493660",
      "fax_number": "63493667",
      "email": "meridian_jc@moe.edu.sg",
      "vision_statement": "A leading institution acclaimed for its academic distinction and richness of learning experiences, in a culture of initiative and empowerment.",
      "mission_statement": "To cultivate learned men and women of calibre, with the heart and will to lead and serve in a challenging world.",
      "philosophy": "na",
      "dgp_code": "PASIR RIS",
      "zone_code": "EAST",
      "cluster_code": "EAST 1",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "Chinese",
      "offer": "Chrystal Programme, Careers & Scholarships Programme, Talent Management Programme, Leadership Development Programme, Reach Programme, Enrichment Programme (Xcite!, Ignite!, iLive, Intr!gue. Sparks)"
    },
    {
      "id": 11,
      "name": "INNOVA JUNIOR COLLEGE",
      "website": "http://www.innovajc.moe.edu.sg/",
      "address": "21 CHAMPIONS WAY",
      "postal_code": 737902,
      "phone_number": "63983401",
      "fax_number": "68943655",
      "email": "innova_jc@moe.edu.sg",
      "vision_statement": "A forward-looking community of leaders and thinkers",
      "mission_statement": "Develop future-ready leaders and thinkers",
      "philosophy": "na",
      "dgp_code": "WOODLANDS",
      "zone_code": "NORTH",
      "cluster_code": "NORTH 7",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "Chinese",
      "offer": "Future Readiness Development Programme, Student Leadership Development Programme, Innova Confident Communicators (ICON) Programme, Global Immersion and Exchange Programmes, Innova Scholars Programme (ISP)."
    },
    {
      "id": 12,
      "name": "EUNOIA JUNIOR COLLEGE",
      "website": "http://www.eunoiajc.moe.edu.sg",
      "address": "53 MOUNT SINAI ROAD",
      "postal_code": 276880,
      "phone_number": "63518388",
      "fax_number": "63518399",
      "email": "eunoiajc@moe.edu.sg",
      "vision_statement": "Every Eunoian a Youth with Purpose, Thinker with Heart, Leader with Courage",
      "mission_statement": "We<br />Enable students to learn continuously,<br />Empower students to seek all-round excellence, and<br />Embolden students to pursue their purpose.",
      "philosophy": "na",
      "dgp_code": "BISHAN",
      "zone_code": "NORTH",
      "cluster_code": "NORTH 1",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "Chinese",
      "offer": "Environmental Literacy Programme<br />Leadership Advancement Programme<br />Liberal Arts Programme<br />Life Coaching Programme<br />Passion Pursuit<br />STEM Research Programme<br />Talent Development Programme<br />World Readiness Programme"
    },
    {
      "id": 13,
      "name": "CATHOLIC JUNIOR COLLEGE",
      "website": "http://www.cjc.edu.sg",
      "address": "129 WHITLEY ROAD",
      "postal_code": 297822,
      "phone_number": "62524083",
      "fax_number": "62537267",
      "email": "catholic_jc@moe.edu.sg",
      "vision_statement": "Building a Generation In Truth & Love: Every CJCian to be a Thinker with a Mission, Leader with a Heart",
      "mission_statement": "We cultivate in each young person the skill and attitude to embrace challenges wisely and courageously. We foster a community that cares for the dignity of young people, nurturing them to be men and women of compassion. We broaden their vision so that they become leaders committed to serve in faith and with integrity.",
      "philosophy": "na",
      "dgp_code": "NOVENA",
      "zone_code": "SOUTH",
      "cluster_code": "SOUTH 5",
      "type": "GOVERNMENT-AIDED SCH",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "na",
      "offer": "Religious / Ethics Programme Overseas Community Projects (10 countries 2008) National Youth Achievement Award (NYAA)  Integrated Leadership Development COL@C : Curriculum Online At CJC"
    },
    {
      "id": 14,
      "name": "ANGLO-CHINESE JUNIOR COLLEGE",
      "website": "http://www.acjc.edu.sg",
      "address": "25 DOVER CLOSE EAST",
      "postal_code": 139745,
      "phone_number": "67750511",
      "fax_number": "67775479",
      "email": "acjc@acjc.edu.sg",
      "vision_statement": "Noble Ambition and Character, for the Service of God and nation.",
      "mission_statement": "ACJC is a Methodist Institution committed to an all-round education of the highest standards based on Christian principles and a consciousness of self, others and God.",
      "philosophy": "na",
      "dgp_code": "QUEENSTOWN",
      "zone_code": "WEST",
      "cluster_code": "WEST 1",
      "type": "GOVERNMENT-AIDED SCH",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "na",
      "offer": "MOE Music and Drama Elective, MOE Humanities and Pre-U Scholarships,  Science Research Programme, ACJC-A*STAR Science Research Symposium, Humanities Symposia, ACJC-EDB Entrepreneurship Education Programme, Performing Arts Programme, ACJC Seminar Series, Extensive Community Involvement Programmes"
    },
    {
      "id": 15,
      "name": "ST. ANDREW'S JUNIOR COLLEGE",
      "website": "http://www.standrewsjc.moe.edu.sg/",
      "address": "5 SORBY ADAMS DRIVE",
      "postal_code": 357691,
      "phone_number": "62857008",
      "fax_number": "62850037",
      "email": "sajc@moe.edu.sg",
      "vision_statement": "Home of Servant Leaders<br />Who Bring Life To The Nations",
      "mission_statement": "Making Lives and Waking Hearts<br />To Serve The Coming Days<br />Family-Society-Eternity",
      "philosophy": "na",
      "dgp_code": "TOA PAYOH",
      "zone_code": "SOUTH",
      "cluster_code": "SOUTH 5",
      "type": "GOVERNMENT-AIDED SCH",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "na",
      "offer": "Academic Pacing Programme, University Options Seminar, Exit Seminars, Work Shadowing, Arts Enrichment Programme, Mentoring and Overseas Community Service."
    },
    {
      "id": 16,
      "name": "NANYANG JUNIOR COLLEGE",
      "website": "http://www.nanyangjc.moe.edu.sg/",
      "address": "128 SERANGOON AVENUE 3",
      "postal_code": 556111,
      "phone_number": "62842281",
      "fax_number": "62855147",
      "email": "nyjc@moe.edu.sg",
      "vision_statement": "A leading college serving the nation with:<br />- Enhanced character development<br />- Quality staff<br />- Quality learners<br />- Organisational excellence",
      "mission_statement": "Uphold Values<br />Enhance Lifeskills<br />Maximise Potential",
      "philosophy": "na",
      "dgp_code": "SERANGOON",
      "zone_code": "SOUTH",
      "cluster_code": "SOUTH 6",
      "type": "GOVERNMENT-AIDED SCH",
      "session": "FULL DAY",
      "main_level": "JUNIOR COLLEGE",
      "language": "na",
      "offer": "Art Elective Programme (AEP), Language Elective Programme (Chinese) (CLEP), Student Leadership Development Programme, Overseas Service-Learning Programme, Career Guidance Programme, Scholar Development Programme, S6 Centre of Excellance for CL and Art"
    },
    {
      "id": 17,
      "name": "HWA CHONG INSTITUTION",
      "website": "http://www.hwachong.edu.sg",
      "address": "661 BUKIT TIMAH ROAD",
      "postal_code": 269734,
      "phone_number": "64683955",
      "fax_number": "67695857",
      "email": "admin@hci.edu.sg",
      "vision_statement": "Empowering our students to Live with Passion and Lead with Compassion.",
      "mission_statement": "We nurture leaders in Research, Industry and Government to serve our nation.",
      "philosophy": "Hwa Chong Institution's (HCI) mission is to nurture leaders for the nation: leaders with a heart to serve the community.  To date, HCI has produced 56 President's Scholars.  Indeed, Hwa Chong is more than a school that produces top scholars. We also want our students to embrace the values of hard work, integrity, passion, and compassion.  All our students receive a sustained character education which encourages them to work with the community through local and global service-learning initiatives.  At Hwa Chong, students approach life with passion. The school provides a caring environment that is intellectually stimulating, secure, and joyful. It offers a curiosity-driven 6-year Integrated Programme (IP). Drawing from the best of East and West, HCI has an extensive global network that links our students to leading universities and industry partners. Working closely with industry captains and professors, students are encouraged to pursue multidisciplinary interests.  Each year, our students go on to leading institutions for their undergraduate study, with a strong entry to some of the world's best universities.  All Hwa Chong students are also committed to serving society.  Hwa Chong prides itself on grooming servant leaders who display civic responsibility and empathy.  Annually, Hwa Chong students provide support and companionship to the underprivileged. Beyond offering assistance, many have partnered key welfare organisations to helm innovative Values-in-Action projects.  As active contributors to civil society, Hwa Chong students have reached out to communities, both locally  and  overseas, through various student-led projects. These projects often mark the beginning of a long-term commitment of service to the community.",
      "dgp_code": "BUKIT TIMAH",
      "zone_code": "WEST",
      "cluster_code": "WEST 6",
      "type": "INDEPENDENT SCHOOL",
      "session": "SINGLE SESSION",
      "main_level": "MIXED LEVEL",
      "language": "Chinese",
      "offer": "MOE   Humanities  Programme,  MOE Art Elective Programme, MOE  Bicultural Studies Programme, MOE Language Elective Programme (Chinese),   Hwa  Chong Talent  Development Programmes - Science & Math Talent, School-Based Gifted Education, Ong Teng Cheong Leadership, Gifted and Talented Education, Entrepreneurial Leadership Boarding, Arts & Sports, Global Outreach, Week-long Sabbaticals,  Service Learning, Third Languages (French, German, Japanese, Malay), Future Problem Solving, Advanced Science Research  (including  Biomedical,  Biotechnology and Bioengineering, Defence Science, Environmental Engineering, Nanotechnology, Material Science, Interactive  Digital  Media  & Electronics), Hwa Chong-Beijing Satellite Campus, Xi'an and Wuxi Winter Campuses. Collaborations with overseas institutions of learning, e.g. Staples High School."
    },
    {
      "id": 18,
      "name": "MILLENNIA INSTITUTE",
      "website": "http://www.millenniainstitute.moe.edu.sg",
      "address": "60 BUKIT BATOK WEST AVENUE 8",
      "postal_code": 658965,
      "phone_number": "63023700",
      "fax_number": "63023767",
      "email": "millennia_inst@moe.edu.sg",
      "vision_statement": "A Forward-looking Community of Learners, Thinkers and Leaders",
      "mission_statement": "Nurturing Talents to Achieve Success.<br />The MI mission is to nurture our students to be grounded on the core values of INTEGRITY, RESILIENCE, RESPECT and RESPONSIBILITY, so that they succeed as contributing members of society.  This is done, in partnership with our stakeholders, by providing a variety of programmes and opportunities to students to have a broad-based learning experience and space to pursue their passion and interests.",
      "philosophy": "na",
      "dgp_code": "BUKIT BATOK",
      "zone_code": "WEST",
      "cluster_code": "WEST 7",
      "type": "GOVERNMENT SCHOOL",
      "session": "FULL DAY",
      "main_level": "CENTRALISED INSTITUTE",
      "language": "Chinese",
      "offer": "MI.World, SkillsFuture, Gap Week, Design Thinking and I & E motivate and equip students with academic and life skills, 21C Competencies to be future-ready and creative and inventive thinkers and empower students to plan their own holistic development."
    },
    {
      "id": 19,
      "name": "BUKIT PANJANG PRIMARY SCHOOL",
      "website": "http://www.bukitpanjangpri.moe.edu.sg",
      "address": "109 CASHEW ROAD",
      "postal_code": 679676,
      "phone_number": "67691912",
      "fax_number": "67637462",
      "email": "BPPS@MOE.EDU.SG",
      "vision_statement": "Future Leaders, Concerned Citizens",
      "mission_statement": "Developing our students holistically in a vibrant and caring environment",
      "philosophy": "BPPS firmly believes that every child is a unique individual with the potential to become self-directed learner grounded in the school's values of Respect, Responsibility, Resilience, Gratitude, Integrity and Compassion. We strive to provide a secure, caring and innovative learning environment that embraces the spirit of enterprise with the courage to take calculated risk. <br /><br />In the academic domain, we are committed to providing student-centric learning experiences that cultivate thinking and promote independent learning in our students.  By purposefully engaging our students to 'think out of the box\", we imbue in them the courage to go beyond their comfort zone. We constantly review our programmes to ensure that they remain relevant, diverse and robust to meet the demands of the educational landscape and cater to our students' needs. <br /><br />Our student development programmes focuses on inculcation of the school values and aims to create opportunities for our students to discover their talents, build their confidence and master 21st century competencies. We offer a plethora of activities such as level camps, student leadership courses and values in action programmes.  <br /><br />Recognising the importance of staff capacity as the key driver to realise our school's vision and mission, we place strong emphasis on staff training and development. Besides formal training, we also strive to create a collaborative learning culture through level sharing, professional learning communities and focused group discussion.",
      "dgp_code": "BUKIT PANJANG",
      "zone_code": "WEST",
      "cluster_code": "WEST 8",
      "type": "GOVERNMENT SCHOOL",
      "session": "SINGLE SESSION",
      "main_level": "PRIMARY",
      "language": "Chinese",
      "offer": "Learning for Life Programme (LLP) -\"i2can dance\" <br />The 'i2 Can Dance!' programme aims to foster confidence, resilience, adaptability and graciousness in our students. Our students' horizon are also widened through increased awareness of the different cultures in Singapore and beyond. Such awareness will also promote better understanding and respect for the different ethnic groups in Singapore<br /><br />Through their participation in the programme, our students also learnt the school values of respect and responsibility, where they are taught to respect the dance form and fellow dancers, to be responsible for their own learning of dance as well as to know what is involved in dance, for instance choreography, technique, costumes and props.<br /><br />The school takes a three-pronged approach to the i2Can Dance! programme: <br />Experience - It provides a broad-based learning for all. <br /><br />Empowerment - It creates opportunities for our pupils to identify their interests and talents and also reflect on their learning and develop to become independent learners through self-assessment.<br /><br />Enhancement and Excellence - It provides an enhanced experience for students who display dance potential. Talented dancers are given a platform to enhance their skills and develop holistically through overseas exchange programmes.<br /><br />Values in Action (VIA)<br />The Values in Action (VIA) in BPPS are rich learning experiences to inculcate active citizenship and civic responsibility among our students. VIA in BPPS begins with students learning how to care for oneself and progressively spiral up to caring for the local community. While the students celebrate their achievements of carrying out the VIA tasks, they also reflect on the values they have put into practice. <br />At the end of six years in BPPS, we believe that with the experiences that our students have gone through, they would be socially responsible citizens who contribute meaningfully to the community."
    },
    {
      "id": 20,
      "name": "HAIG GIRLS' SCHOOL",
      "website": "http://www.haiggirls.moe.edu.sg",
      "address": "51 KOON SENG ROAD",
      "postal_code": 427072,
      "phone_number": "63440293",
      "fax_number": "64474169",
      "email": "HAIGGIRLSSCH@MOE.EDU.SG",
      "vision_statement": "Leaders of Character, Striving for Excellence in a Vibrant School",
      "mission_statement": "To nurture self-directed learners and critical and creative thinkers who lead and serve with integrity and compassion.",
      "philosophy": "Established in 1951, Haig Girls' School (HGS) is an all-girls' government primary school.  Our school has a heritage of excellent all-round education.  Nurturing character, leadership and creativity is the hallmark of an education at HGS that has endured over the decades. We believe in nurturing the whole child and preparing our pupils for life through a distinctive learning experience that is values-based, engaging, rigorous and innovative. <br /><br />Our shared values are encapsulated in our I4Cs: Integrity, Commitment, Concern, Cooperation, and Creativity. Guided by our school motto 'Ars Potens Est' ('Knowledge is Power'), we strive to nurture every Haig girl to use her knowledge, skills and talents in service to the school, community and nation.   We believe that our pupils are never too young to make a difference and give them a voice through advocacy, service, creative expression and innovation.<br /><br />HGS is a second home to our pupils - a safe, nurturing environment for them to be themselves and to grow and learn. We believe in the uniqueness and worth of every child - each child is different, special and talented in her own way and we seek to bring out the best in her. We love, value and accept each child for who she is regardless of her results or achievements, but we hold her to high expectations. In HGS, we would like each child to take responsibility for her learning and develop an intrinsic motivation to learn, grow and excel. We believe in a growth mindset -- with effort, perseverance and resilience, every child can think, learn, achieve and excel.",
      "dgp_code": "GEYLANG",
      "zone_code": "EAST",
      "cluster_code": "EAST 5",
      "type": "GOVERNMENT SCHOOL",
      "session": "SINGLE SESSION",
      "main_level": "PRIMARY",
      "language": "Chinese",
      "offer": "LLP - Character and Leadership through Performing & Visual Arts: Our whole-school approach to the arts allows pupils to demonstrate creativity, express themselves, develop character and deepen sense of pride in our multi-cultural heritage through diverse learning experiences in art, music, drama and dance.<br />-ALP - Innovation & Service Learning through Integrated Project Work: IPW@HGS involves inter-disciplinary place-based learning, authentic problem-solving and value creation. Service learning is embedded as pupils apply knowledge and skills to address civic issues. They collaborate to create solutions, artworks or creative writing, acquiring 21st century competencies (21CC) such as critical and creative thinking, collaboration and communication skills.<br />-The Inspired Museum Explorers, Our Unique Travels (TIMEOUT): the inter-disciplinary museum-based learning programme develops visual literacy, nurtures creative thinking and fosters a sense of pride in Singapore's cultural heritage.<br />-Holistic Assessment (HA) with Holistic Reporting and Parent-Child-Teacher Conferencing (PCTC): As prototype school for HA, we adopt a balanced assessment system with formative and summative assessment. Assessment is embedded into teaching and enables teachers to provide quality feedback to pupils and deepen their learning in various domains such as the arts, values, leadership and 21CC.  Pupils own their learning through reflection and self-assessment, taking the lead at PCTC, to share with parents their progress and areas for growth. <br />-Discover, Develop & Dedicate your Talent Time (D3T2): talent development programmes in the Performing & Visual Arts, Sports, Mathematics, Science & ICT.<br />-Teaching Through the Arts Programme (TTAP): incorporating drama and movement in the learning of Math and Science<br />-Knowledge Building: an inquiry approach to science learning. Pupils work together to ask questions, test hypotheses, improve on peers' ideas and co-construct scientific understanding."
    }
  ]
}
#+end_example

* ElasticSearch

#+BEGIN_SRC http :pretty
  GET http://localhost:9200/schools/_search?q=Nanyang
#+END_SRC

#+RESULTS:
#+begin_example
{
  "took": 206,
  "timed_out": false,
  "_shards": {
    "total": 4,
    "successful": 4,
    "skipped": 0,
    "failed": 0
  },
  "hits": {
    "total": 7,
    "max_score": 6.6910458,
    "hits": [
      {
        "_index": "schools",
        "_type": "doc",
        "_id": "299",
        "_score": 6.6910458,
        "_source": {
          "name": "NANYANG PRIMARY SCHOOL",
          "website": "http://www.nyps.moe.edu.sg",
          "address": "52 KING'S ROAD",
          "postal_code": 268097,
          "phone_number": "64672677",
          "fax_number": "64686913",
          "email": "NYPS@MOE.EDU.SG",
          "vision_statement": "Learners of Character, Leaders in Action",
          "mission_statement": "Developing our pupils to reach their fullest potential within a bicultural environment that is steeped in diligence, prudence, respectability and simplicity, thereby enabling them to contribute to society.",
          "philosophy": "Nanyang Primary School (NYPS) was established in 1917 as the primary section of The Singapore Nanyang Girls' School. NYPS was separated from the secondary section in 1978 due to increasing pupil enrolment and has functioned as a single-session school since 2004.  It was accorded the Special Assistance Plan (SAP) status in 1984.  In 1990, it began to offer MOE's Gifted Education Programme (GEP). <br /><br />The school strives to provide an education which prepares the students beyond academic excellence. With the provision of a bi-cultural learning environment, students are nurtured to be learners of character and leaders who will create a positive impact on their communities and society. <br /><br />The Nanyang Curriculum adopts the Head, Heart and Hands approach for the holistic development of the students, as the school believes that internalisation, reflection and putting into action values and skills, are key to learning. The key leverage for the holistic development of students in the Nanyang Curriculum is differentiation which caters to students' different learning needs. Building on its rich Chinese traditions and values while equipping our students with 21st century skills and competencies underscores curriculum innovation in NYPS.  <br /><br />An extensive culture for learning and innovation permeates the school as evident in the whole school embarking on the Professional Learning Community (PLC) journey, introducing Lesson Study (LS) as an additional tool to Action Research (AR) and Learning Circle (LC) for teachers to implement curriculum innovations that will deepen their pedagogical knowledge.  <br /><br />The school also believes in establishing strong partnership for the holistic development of students.  The key partners comprising the School Management Committee, Nanyang Schools Alumni Association and Parent Teacher Association work collaboratively to preserve the NYPS spirit and identity, reinforcing the values-based culture via role-modelling and their contributions and support.",
          "dgp_code": "BUKIT TIMAH",
          "zone_code": "WEST",
          "cluster_code": "WEST 5",
          "type": "GOVERNMENT-AIDED SCH",
          "session": "SINGLE SESSION",
          "main_level": "PRIMARY",
          "language": "Chinese",
          "offer": "The \"Learning Cultures through Dance\" Learning for Life Programme in Nanyang Primary School aims to develop our pupils holistically beyond academic excellence by building character with understanding of self, others and cultures and developing peaks of growth and excellence. <br /><br />Through this programme pupils learn various dance techniques; acquire knowledge related to the history of the dance; discover their potential through individual dance movements and cooperative social interaction; appreciate the aesthetic aspects of performances; gain a deeper understanding and appreciation of the various ethnic groups in Singapore and the different nationalities of the world.<br /><br />The \"Critical Thinking through Mind Sports\" Applied Learning Programme aims to cultivate in pupils a love for Mind Sports where they learn to find joy and satisfaction in a board game fully embedded with strategy and thinking skills. Through the process of learning and play, pupils acquire life and social-emotional skills; develop strong character traits, cognitive skills and psychological build-up that will serve them well not only during competitions but in daily life situations in the 21st Century.  <br /><br />Through the programme, pupils learn how to interact both on and off the playing board; develop communication, cross-cultural and socio-emotional skills; acquire skills to manage self and relationship; develop thinking skills for Mathematical learning;  acquire key attributes central to the spirit of innovation and enterprise; develop skills in becoming a self-directed learner.<br /><br />Besides the 2 Signature Programmes, NYPS also offers Appreciating Flora Art; Choir; Chinese Dance; Guzheng; Chinese Orchestra; International Dance; String Ensemble; Ceramic Art; Drawing; Photography; Badminton; Basketball; Football; Table Tennis; Tennis; Track & Field; Swimming; Wushu; Golf; International Chess; Boys' and Girls' Brigade; Scouts; Brownies; Advanced Mathematics Enrichment Club; Green Club; Weiqi."
        }
      },
      {
        "_index": "schools",
        "_type": "doc",
        "_id": "344",
        "_score": 5.119422,
        "_source": {
          "name": "NANYANG GIRLS' HIGH SCHOOL",
          "website": "http://www.nygh.moe.edu.sg",
          "address": "2 LINDEN DRIVE",
          "postal_code": 288683,
          "phone_number": "64663275",
          "fax_number": "64667564",
          "email": "NYGHS@MOE.EDU.SG",
          "vision_statement": "Every Nanyang Girl a Respected Member of Society",
          "mission_statement": "We nurture women of character in a bilingual bicultural environment anchored in values on which our school was founded.",
          "philosophy": "Nanyang Girls' High School has a rich tradition and illustrious history. Founded in 1917, the school has remained true to her goal in nurturing well-educated ladies who will contribute to society. Given the school's rich tradition in bicultural education, NYGH prides herself in providing a holistic education, allowing all girls to thrive in a globalised world.  Our curriculum is anchored in values that seek to develop our students to be reflective, responsive and responsible learners, equipped with the knowledge, skills and attributes for the future. The Nanyang experience engages our students in authentic and relevant learning that guides them to create meaningful, useful and shared outcomes. The curriculum allows students to make meaningful connections within and between disciplines, and develop a heart for the community by paying forward through active service. We also keep our students engaged and excited about learning through 1-1 computing. In addition, through our carefully designed experiential learning opportunities that include the Boarding School Experience at our very own Boarding School and our Global Classroom Programme, we provide our students with a holistic education ready for the globalised future.",
          "dgp_code": "BUKIT TIMAH",
          "zone_code": "WEST",
          "cluster_code": "WEST 6",
          "type": "INDEPENDENT SCHOOL",
          "session": "SINGLE SESSION",
          "main_level": "SECONDARY",
          "language": "Chinese",
          "offer": "Nanyang Seal of Excellence Talent Development Programme <br />- Four-Tier Chinese Language and Culture Programme which includes Bicultural Studies (Chinese) and Chinese Language Elective Programme<br />. Humanities Programme<br />. Science and Mathematics Talent Programme<br />. Leadership Development<br />. Art Elective Programme (AEP)<br />. Higher Music Programme (HMP)<br /><br />Other programmes that further enrich the students' holistic learning experience include:<br />. Global Classroom Programme<br />. Interdisciplinary Studies<br />. Work Experience Programme<br />. Extended Classroom Programme<br />. Boarding School Experience<br />. Conversational Malay<br />. Community Education and Community Leadership Programme<br />. Philosophical Inquiry<br />. Research Programme<br />. Translation<br />. Drama<br />. Conversational Malay<br /><br />Third Language - NYGH offers Malay Special Programme"
        }
      },
      {
        "_index": "schools",
        "_type": "doc",
        "_id": "16",
        "_score": 4.545814,
        "_source": {
          "name": "NANYANG JUNIOR COLLEGE",
          "website": "http://www.nanyangjc.moe.edu.sg/",
          "address": "128 SERANGOON AVENUE 3",
          "postal_code": 556111,
          "phone_number": "62842281",
          "fax_number": "62855147",
          "email": "nyjc@moe.edu.sg",
          "vision_statement": "A leading college serving the nation with:<br />- Enhanced character development<br />- Quality staff<br />- Quality learners<br />- Organisational excellence",
          "mission_statement": "Uphold Values<br />Enhance Lifeskills<br />Maximise Potential",
          "philosophy": "na",
          "dgp_code": "SERANGOON",
          "zone_code": "SOUTH",
          "cluster_code": "SOUTH 6",
          "type": "GOVERNMENT-AIDED SCH",
          "session": "FULL DAY",
          "main_level": "JUNIOR COLLEGE",
          "language": "na",
          "offer": "Art Elective Programme (AEP), Language Elective Programme (Chinese) (CLEP), Student Leadership Development Programme, Overseas Service-Learning Programme, Career Guidance Programme, Scholar Development Programme, S6 Centre of Excellance for CL and Art"
        }
      },
      {
        "_index": "schools",
        "_type": "doc",
        "_id": "339",
        "_score": 4.3820286,
        "_source": {
          "name": "CHUNG CHENG HIGH SCHOOL (MAIN)",
          "website": "http://www.chungchenghighmain.moe.edu.sg",
          "address": "50 GOODMAN ROAD",
          "postal_code": 439012,
          "phone_number": "63441393",
          "fax_number": "63449686",
          "email": "CCHMS@MOE.EDU.SG",
          "vision_statement": "Institution of Eminence, Generations of Leaders; Grounded in Values, Global in Outlook",
          "mission_statement": "Empowering our students to be Role Models of Learning, Leaders of Society and Pillars of the Nation.",
          "philosophy": "Guided by the school's philosophy \"Excellence in Education for All\", Chung Cheng High School (Main) is committed to the development of our students and the nurturing of 21st century leaders through a holistic learning experience anchored on strong values. As the East Zone Centre of Excellence (Chinese), the school seeks to promote good practices in the teaching and learning of Chinese and Chinese Culture. A SAP school since 1979, we are committed to deliver an effective bilingual and values-based education. Through comprehensive bi-cultural programmes and various overseas immersion programmes, the school aims to nurture bi-cultural Chung Cheng leaders who are grounded in values, global in outlook and equipped with cross-cultural literacy. The school's rich tradition in culture and arts has seen many renowned talents in the cultural, literary and arts scene amongst our graduates. The Chung Cheng Education Framework focuses on delivering a forward-looking curriculum for the 21st century, equipping all students of Chung Cheng the values and skills that will enable them to excel in the evolving global landscape. As<br />an institution of eminence, the school offers a scenic and cultural environment with ample facilities to continue delivering quality education well into the 21st century.",
          "dgp_code": "MARINE PARADE",
          "zone_code": "EAST",
          "cluster_code": "EAST 4",
          "type": "GOVERNMENT-AIDED SCH",
          "session": "SINGLE SESSION",
          "main_level": "SECONDARY",
          "language": "Chinese",
          "offer": "(1) Special Assistance Plan (SAP) School Programmes: Bi-cultural Education Programmes which include Appreciation of Chinese Culture lessons, Calligraphy & Chinese Painting lessons, Tea Art Appreciation lessons, Wushu lessons as part of PE, Dizhi (Chinese Flute) lessons, Learning Journeys to Heritage Centres. (2) Special Development Programmes in the areas of Chinese & Culture (Media production in Chinese, Translation, Literary Writing), Mathematics and Science, Art and Music.(3) Special Interest Programmes: Heritage Docent Programmes (Sun Yat Sen Nanyang Memorial Hall, Malay Heritage Centre). (4) Overseas Learning Programmes: Overseas School Immersion Programme (China Chongqing, Shanghai, Suzhou),<br />Overseas Leadership Development Programme."
        }
      },
      {
        "_index": "schools",
        "_type": "doc",
        "_id": "251",
        "_score": 3.6864243,
        "_source": {
          "name": "TANGLIN SECONDARY SCHOOL",
          "website": "http://www.tanglinsec.moe.edu.sg",
          "address": "301 WEST COAST ROAD",
          "postal_code": 127391,
          "phone_number": "64248200",
          "fax_number": "67734457",
          "email": "tanglin_ss@moe.edu.sg",
          "vision_statement": "Leaders of the Future, Pride of the Community",
          "mission_statement": "A caring school with an innovative and engaging curriculum, TSS equips our students with the skills for active lifelong learning and inculcates in them core values that will guide them to succeed in a changing world.",
          "philosophy": "Guided by our philosophy 'Everyone Is Unique, All Can Succeed', we provide students with rich opportunities to discover and pursue their passion so that they can define success in multiple ways. We strive towards a culture of active learning, ensuring students experience joy in learning that drive their self-directedness. To prepare students for the VUCA (Volatile, Uncertain, Complex, Ambiguous) world, we value the spirit of exploration, cultivating in students the capacity to think critically, creatively and inventively to solve problems. We want them to persevere through challenges and have the flexibility to seize opportunities. All these are grounded on the values of Respect, Responsibility, Resilience, Integrity, Care and Curiosity to Learn that ensure students work collaboratively, exercise leadership and grow to become contributing members of the community.",
          "dgp_code": "CLEMENTI",
          "zone_code": "WEST",
          "cluster_code": "WEST 1",
          "type": "GOVERNMENT SCHOOL",
          "session": "SINGLE SESSION",
          "main_level": "SECONDARY",
          "language": "Chinese",
          "offer": "The TSS curriculum is designed to provide students with rich learning opportunities to maximise their potential in the academic and co-curricular areas for future-readiness. Students can pursue subjects such as Electronics, Literature (English) and Art, on top of Pure Sciences and Additional Mathematics. Our Applied Learning Programme, Tanglin PLUS, is a distinctive programme which gives focus to the Humanities. It is aimed at developing students to become informed persons, critical thinkers, confident and effective communicators. Tanglin PLUS takes the learning of Geography, History and Social Studies beyond the classroom, enabling students to apply their knowledge and skills to real-life contexts such as in habitat enhancement programmes in the Singapore Botanic Gardens and community programmes that promote Singapore's unity and security. Tanglin PLUS complements the school's existing strengths in Mathematics, Science and Applied Subjects. For its Lifelong Learning Programme (LLP), TSS is proud to offer the Arts Programme, focusing on Music, Dance and Visual Arts. Students begin with a broad-based exposure to various musical, dance and visual art forms before opting for talent development electives to deepen their skills in show choir, dance, guitar or the visual arts. In collaboration with NAFA and NAC, the Arts Programme also provides students the exposure to the local arts scene and the career opportunities it has to offer. In TSS, it is always about growing leaders. Our customised four-year Student Leadership Development Programme ensures that students are equipped with the leadership skills and competencies so that they become compassionate leaders who are ready to serve society. The partnerships with National University of Singapore, Nanyang Technological University and Singapore Institute of Technology enable us to offer leadership mentoring programmes that inspire our students to set high goals for themselves and strive for excellence."
        }
      },
      {
        "_index": "schools",
        "_type": "doc",
        "_id": "222",
        "_score": 3.4654796,
        "_source": {
          "name": "BROADRICK SECONDARY SCHOOL",
          "website": "http://www.broadricksec.moe.edu.sg",
          "address": "61 DAKOTA CRESCENT",
          "postal_code": 399935,
          "phone_number": "63445025",
          "fax_number": "64471427",
          "email": "BROADRICK_SS@MOE.EDU.SG",
          "vision_statement": "A Dynamic School providing Holistic Education",
          "mission_statement": "Nurturing Broadricans to be future-ready learners with Strength of Character",
          "philosophy": "Broadrick's vision is to become a vibrant learning community where Broadricians will be equipped with life skills and knowledge to meet the challenges of a complex and changing environment.  We educate the whole child and ensure that learning is developmentally appropriate to increase confidence and motivation for learning.<br /><br />Our educational programmes provide opportunities for every Broadrician to be all-rounded and have the zest to lead a purposeful life.  In Broadrick, we focus on developing self-directed Broadricians who are rooted in values.  We also want to educate Broadricians to embrace the spirit of innovation and enterprise so that they are empowered to take calculated risks and develop the resilience to face future challenges.  Teachers are key and students are our focus.  Establishing quality relationships with our stakeholders is crucial to nurture students entrusted in our care.  Broadricians have a sense of responsibility to contribute to the family, school, community, nation and world with the purpose of making a difference.  They learn to serve and serve to learn from others.",
          "dgp_code": "GEYLANG",
          "zone_code": "EAST",
          "cluster_code": "EAST 5",
          "type": "GOVERNMENT SCHOOL",
          "session": "SINGLE SESSION",
          "main_level": "SECONDARY",
          "language": "Chinese",
          "offer": "We are recognised by MOE for \"Entrepreneurship in STEM\", which is an applied learning programme that help our students to become inquisitive leaders, critical and creative thinkers who embrace the spirit of creativity and enterprise.  Through school-based Science curriculum, students are involved in inquiry-based projects in collaboration with partners from Science Centre and Nanyang Polytechnic.  Students also learn about design thinking, marketing and examine commercial viability in product designs.  Enrichment activities include hands-on experience in constructing prototype and the Broadrick Digital Intelligence (DI) Programme, making our students to be part of a new generation of digital natives.<br /><br />In our Learning for Life Programme, we nurture Confidence And REsilience (CARE) through Aesthetics, Community and Youth Leadership.  Service Learning is our adopted methodology for experiential learning to develop character and 21st century competencies in our students.  Our comprehensive Service Learning and Aesthetics programmes are structured into the school curriculum and every student is given an opportunity to be exposed to rich, authentic learning experiences as they work with others and with the community at large.  Through these platforms, we aim to progressively develop important life skills in students, such as critical thinking, communication, leadership and active citizenry."
        }
      },
      {
        "_index": "schools",
        "_type": "doc",
        "_id": "250",
        "_score": 2.850239,
        "_source": {
          "name": "SERANGOON GARDEN SECONDARY SCHOOL",
          "website": "http://www.sgs.edu.sg",
          "address": "21 SERANGOON NORTH AVENUE 1",
          "postal_code": 555889,
          "phone_number": "62889227",
          "fax_number": "62888695",
          "email": "sgss@moe.edu.sg",
          "vision_statement": "Critical Thinkers. Thoughtful Leaders.",
          "mission_statement": "Love to Learn, Learn to Lead.",
          "philosophy": "Since 1959, Serangoon Garden Secondary School (SGS) has been enjoying the trust and confidence of the community and alumni over the last 58 years.  The SGS brand of education is known and valued for growing our students to be future-ready in the culture of care, learning and excellence. The culture of care is evident in the school as our students grow and develop in a safe and nurturing environment, marked by respect for teachers and peers. Anchored on the culture of learning, the vision of the school is based upon our commitment to educate our students to be able to exercise sound reasoning and reflective thinking to make good decisions and manage complexities and ambiguities. They are also able to lead themselves and others effectively with empathy and the heart to care and serve with PRIDE. One of our key beliefs is that all our students are able to learn. As such, we have in place systems and processes to stretch the talent of our higher ability students; at the same time, we have a range of student-centric intervention programmes to help the weaker students so that they can progress and achieve. Committed to the culture of excellence, we challenge our students to take responsibility for their learning, while giving them the necessary support to realise their aspirations. Our goal is to nurture your child academically, grow them socially and emotionally, and guide them towards independent thinking and problem solving. Our end goal is that SGSians will be 'Critical Thinkers and Thoughtful Leaders.'",
          "dgp_code": "SERANGOON",
          "zone_code": "SOUTH",
          "cluster_code": "SOUTH 1",
          "type": "GOVERNMENT SCHOOL",
          "session": "SINGLE SESSION",
          "main_level": "SECONDARY",
          "language": "Chinese",
          "offer": "All students enrolling in SGS are emplaced on our signature Applied Learning Programme (ALP), 'Researching Society Using Media Communication', which provides students with opportunities to apply higher order thinking skills in real-life contexts, making learning relevant and meaningful to the students. Our Learning for Life Programme (LLP) focuses on 'Nurturing Confident and Compassionate Leaders', provides students with the opportunities to hone their leadership skills and develop into confident leaders. <br />Students in the Express Course enjoy course attachments with Nanyang Polytechnics as part of our extensive ECG collaborations, while students in the Normal Course will benefit from student-centred programmes which are acknowledged by MOE through the Lee Hsien Loong Award for Innovations in the Normal Course that inculcate 21st century competencies and skills to prepare them for life. In addition, SGS offers the Academic and Character Excellence (ACE) Scholarship, sponsored by our School Advisory Committee(SAC). Express students with at least 225 points, NA students with at least 185 points and N(T) students with at least 150 points from the PSLE, who apply for our school as their first choice, will be considered. These students must have at least a 'Very Good' Conduct Grade. They will be involved in our signature programmes to stretch and prepare them to be future ready: <br />Sec 1 Science Research Programme to open the minds of our young students to the world of Science through Inquiry and Research.<br />Sec 2 Cultural Immersion Programme to encourage talented students to participate in an immersion programme with our twinning schools in Xi'an, China. This programme is also opened to non-Chinese students.<br />Sec 3 ALP Programme to provide a platform for students to facilitate learning for peers and members of the public, while giving back to the community. <br />Sec 4/5 Job Attachment Programme for our students to experience the real-world of work."
        }
      }
    ]
  }
}
#+end_example
